{"keras_version": "1.1.2", "config": [{"config": {"activation": "linear", "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_filter": 48, "init": "he_normal", "activity_regularizer": null, "batch_input_shape": [null, 20, 80.0, 3], "name": "convolution2d_49", "nb_col": 3, "border_mode": "same", "bias": true, "input_dtype": "float32", "W_regularizer": null, "nb_row": 3, "trainable": true, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_49", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_117"}, "class_name": "Activation"}, {"config": {"activation": "linear", "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "name": "convolution2d_50", "nb_col": 3, "border_mode": "same", "bias": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "trainable": true, "b_constraint": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_50", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_118"}, "class_name": "Activation"}, {"config": {"activation": "linear", "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_filter": 80, "subsample": [1, 1], "name": "convolution2d_51", "nb_col": 3, "border_mode": "same", "bias": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "trainable": true, "b_constraint": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_51", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_119"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_17"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_30", "p": 0.2}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 512, "input_dim": null, "name": "dense_85", "b_regularizer": null, "init": "he_normal", "trainable": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_120"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 256, "input_dim": null, "name": "dense_86", "b_regularizer": null, "init": "he_normal", "trainable": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_121"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 128, "input_dim": null, "name": "dense_87", "b_regularizer": null, "init": "he_normal", "trainable": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_122"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 64, "input_dim": null, "name": "dense_88", "b_regularizer": null, "init": "he_normal", "trainable": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_123"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_31", "p": 0.2}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 16, "input_dim": null, "name": "dense_89", "b_regularizer": null, "init": "he_normal", "trainable": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_124"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 1, "input_dim": null, "name": "dense_90", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}