{"config": [{"config": {"dim_ordering": "tf", "activation": "linear", "bias": true, "nb_row": 3, "name": "convolution2d_10", "input_dtype": "float32", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "trainable": true, "batch_input_shape": [null, 20, 80.0, 3], "nb_filter": 48, "W_constraint": null, "border_mode": "same", "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_10", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_25", "activation": "elu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "nb_row": 3, "bias": true, "init": "he_normal", "name": "convolution2d_11", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "trainable": true, "nb_filter": 64, "W_constraint": null, "border_mode": "same", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_11", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_26", "activation": "elu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "nb_row": 3, "bias": true, "init": "he_normal", "name": "convolution2d_12", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "trainable": true, "nb_filter": 80, "W_constraint": null, "border_mode": "same", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_12", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_27", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_4"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_7", "p": 0.2}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_19", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "output_dim": 512, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_28", "activation": "elu"}, "class_name": "Activation"}, {"config": {"bias": true, "name": "dense_20", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "output_dim": 256, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_29", "activation": "elu"}, "class_name": "Activation"}, {"config": {"bias": true, "name": "dense_21", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "output_dim": 128, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_30", "activation": "elu"}, "class_name": "Activation"}, {"config": {"bias": true, "name": "dense_22", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "output_dim": 64, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_31", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_8", "p": 0.2}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_23", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "output_dim": 16, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_32", "activation": "elu"}, "class_name": "Activation"}, {"config": {"bias": true, "name": "dense_24", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "output_dim": 1, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}