{"config": [{"config": {"name": "batchnormalization_1", "beta_regularizer": null, "gamma_regularizer": null, "batch_input_shape": [null, 20, 80.0, 3], "mode": 0, "input_dtype": "float32", "axis": -1, "trainable": true, "momentum": 0.99, "epsilon": 1e-05}, "class_name": "BatchNormalization"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "nb_col": 1, "init": "he_normal", "b_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "nb_filter": 10, "W_regularizer": null, "name": "convolution2d_1", "activity_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "nb_col": 1, "init": "he_normal", "b_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "nb_filter": 3, "W_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "init": "he_normal", "b_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "nb_filter": 60, "W_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "init": "he_normal", "b_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "nb_filter": 90, "W_regularizer": null, "name": "convolution2d_4", "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "init": "he_normal", "b_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "nb_filter": 120, "W_regularizer": null, "name": "convolution2d_5", "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "valid", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "strides": [1, 3], "trainable": true, "border_mode": "valid", "pool_size": [1, 3]}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null, "output_dim": 640, "W_constraint": null, "W_regularizer": null, "input_dim": null, "name": "dense_1", "activity_regularizer": null, "init": "he_normal", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null, "output_dim": 320, "W_constraint": null, "W_regularizer": null, "input_dim": null, "name": "dense_2", "activity_regularizer": null, "init": "he_normal", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null, "output_dim": 160, "W_constraint": null, "W_regularizer": null, "input_dim": null, "name": "dense_3", "activity_regularizer": null, "init": "he_normal", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null, "output_dim": 80, "W_constraint": null, "W_regularizer": null, "input_dim": null, "name": "dense_4", "activity_regularizer": null, "init": "he_normal", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_9", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null, "output_dim": 20, "W_constraint": null, "W_regularizer": null, "input_dim": null, "name": "dense_5", "activity_regularizer": null, "init": "he_normal", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_10", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null, "output_dim": 1, "W_constraint": null, "W_regularizer": null, "input_dim": null, "name": "dense_6", "activity_regularizer": null, "init": "glorot_uniform", "trainable": true}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}