{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "gamma_regularizer": null, "axis": -1, "batch_input_shape": [null, 20, 80.0, 3], "name": "batchnormalization_1", "trainable": true, "mode": 0, "beta_regularizer": null, "input_dtype": "float32", "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"nb_row": 1, "init": "he_normal", "name": "convolution2d_1", "trainable": true, "border_mode": "same", "W_constraint": null, "W_regularizer": null, "nb_filter": 10, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "nb_col": 1, "activation": "linear", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 1, "init": "he_normal", "name": "convolution2d_2", "trainable": true, "border_mode": "same", "W_constraint": null, "W_regularizer": null, "nb_filter": 3, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "nb_col": 1, "activation": "linear", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_2", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "gamma_regularizer": null, "axis": -1, "name": "batchnormalization_2", "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "init": "he_normal", "name": "convolution2d_3", "trainable": true, "border_mode": "same", "W_constraint": null, "W_regularizer": null, "nb_filter": 32, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "activation": "linear", "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "init": "he_normal", "name": "convolution2d_4", "trainable": true, "border_mode": "same", "W_constraint": null, "W_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "activation": "linear", "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "init": "he_normal", "name": "convolution2d_5", "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "nb_filter": 96, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "activation": "linear", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_5", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "init": "he_normal", "name": "convolution2d_6", "trainable": true, "border_mode": "valid", "W_constraint": null, "W_regularizer": null, "nb_filter": 128, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "activation": "linear", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_6", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "name": "dense_1", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "output_dim": 512, "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "name": "dense_2", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "output_dim": 256, "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "name": "dense_3", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "output_dim": 128, "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_9", "trainable": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "name": "dense_4", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "output_dim": 64, "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_10", "trainable": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "name": "dense_5", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "output_dim": 32, "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_11", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_6", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "output_dim": 1, "b_constraint": null, "bias": true}}]}