{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_1", "momentum": 0.99, "input_dtype": "float32", "batch_input_shape": [null, 20, 80.0, 3], "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "axis": -1, "epsilon": 1e-05}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "b_regularizer": null, "name": "convolution2d_1", "nb_col": 1, "b_constraint": null, "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_filter": 10, "W_constraint": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "nb_row": 1}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "b_regularizer": null, "name": "convolution2d_2", "nb_col": 1, "b_constraint": null, "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_filter": 3, "W_constraint": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "nb_row": 1}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "b_regularizer": null, "name": "convolution2d_3", "nb_col": 3, "b_constraint": null, "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_filter": 60, "W_constraint": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "b_regularizer": null, "name": "convolution2d_4", "nb_col": 3, "b_constraint": null, "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_filter": 90, "W_constraint": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_5", "nb_col": 3, "b_constraint": null, "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_filter": 120, "W_constraint": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "subsample": [1, 1], "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "border_mode": "valid", "strides": [1, 3], "pool_size": [1, 3], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "name": "dense_1", "output_dim": 640, "b_constraint": null, "trainable": true, "input_dim": null, "init": "he_normal", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "name": "dense_2", "output_dim": 320, "b_constraint": null, "trainable": true, "input_dim": null, "init": "he_normal", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "name": "dense_3", "output_dim": 160, "b_constraint": null, "trainable": true, "input_dim": null, "init": "he_normal", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "name": "dense_4", "output_dim": 80, "b_constraint": null, "trainable": true, "input_dim": null, "init": "he_normal", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_9", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "name": "dense_5", "output_dim": 20, "b_constraint": null, "trainable": true, "input_dim": null, "init": "he_normal", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_10", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "name": "dense_6", "output_dim": 1, "b_constraint": null, "trainable": true, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true}}]}