{"config": [{"config": {"dim_ordering": "tf", "activation": "linear", "bias": true, "nb_row": 3, "name": "convolution2d_4", "input_dtype": "float32", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "trainable": true, "batch_input_shape": [null, 20, 80.0, 3], "nb_filter": 48, "W_constraint": null, "border_mode": "same", "init": "he_normal"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_4", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_9", "activation": "elu"}, "class_name": "Activation"}, {"config": {"mode": 0, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "axis": -1, "name": "batchnormalization_4", "epsilon": 1e-05, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"dim_ordering": "tf", "nb_row": 3, "bias": true, "init": "he_normal", "name": "convolution2d_5", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "trainable": true, "nb_filter": 64, "W_constraint": null, "border_mode": "same", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_5", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_10", "activation": "elu"}, "class_name": "Activation"}, {"config": {"mode": 0, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "axis": -1, "name": "batchnormalization_5", "epsilon": 1e-05, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"dim_ordering": "tf", "nb_row": 3, "bias": true, "init": "he_normal", "name": "convolution2d_6", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "trainable": true, "nb_filter": 80, "W_constraint": null, "border_mode": "same", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_6", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_11", "activation": "elu"}, "class_name": "Activation"}, {"config": {"mode": 0, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "axis": -1, "name": "batchnormalization_6", "epsilon": 1e-05, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_7", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "output_dim": 512, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_12", "activation": "elu"}, "class_name": "Activation"}, {"config": {"bias": true, "name": "dense_8", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "output_dim": 256, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_13", "activation": "elu"}, "class_name": "Activation"}, {"config": {"bias": true, "name": "dense_9", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "output_dim": 128, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_14", "activation": "elu"}, "class_name": "Activation"}, {"config": {"bias": true, "name": "dense_10", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "output_dim": 64, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_15", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.2}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_11", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "b_constraint": null, "output_dim": 16, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_16", "activation": "elu"}, "class_name": "Activation"}, {"config": {"bias": true, "name": "dense_12", "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "output_dim": 1, "input_dim": null, "W_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}